{
  "settings": {
    "icons": true
  },
  "firstname": "Michael",
  "familyname": "Weigle",
  "linkedin_id": "michaelweigle",
  "github_id": "metricmike",
  "bio_data": {
    "email": "michael.weigle@gmail.com",
    "phone": "+1 (615) 852-7737",
    "website": "http://metricmike.github.io",
    "skills": {
      "details": [
        {
          "type": "Programming Languages",
          "items": [
            "Ruby",
            "Java",
            "Javascript",
            "PHP"
          ]
        },
        {
          "type": "Web Frameworks and Libraries",
          "items": [
            "Rspec",
            "Rails",
            "Sass",
            "Leaflet",
            "Nokogiri"
          ]
        },
        {
          "type": "Databases",
          "items": [
            "MySQL",
            "PostgreSQL",
            "Lucene/Solr",
            "SQLite3"
          ]
        },
        {
          "type": "Certifications",
          "items": [
            "CompTIA A+",
            "CompTIA Network+",
            "CompTIA Security+"
          ]
        }
      ]
    },
    "education": {
      "schools": [
        {
          "degree": "Bachelor's",
          "major": "Computer Science",
          "institution": "University of Richmond",
          "graduation_year": 2013
        }
      ]
    },
    "experience": {
      "items": [
        {
          "title": "Company Executive Officer",
          "organisation": "US Army, 442nd Sig BN, HQ/A Co",
          "from": "Aug 2014",
          "to": "Nov 2014",
          "details": [
            "Provided supervision for and coordination between 35 Soldiers and 17 DA Civilians in conducting company operations (records management, battalion taskings, utilization for 15-60 students awaiting class) and filling annual training requirements.",
            "Planned and organized monthly 'Zero Week' events for 30-35 students: a week-long onboarding designed for Captains attending training at Fort Gordon to complete educational attendance requirements (fitness tests, post in-processing, medical readiness), and highlight local resources, career opportunities, and Signal Corps goals."
          ]
        },
        {
          "title": "Platoon Leader, Operations OIC",
          "organisation": "US Army Reserves, 377th CBRN Co",
          "from": "Jun 2012",
          "to": "Dec 2013",
          "details": [
            "Led a group of 30-35 junior Soldiers to develop technical competence and both professional and personal goals.",
            "Ensured platoon medical, training, and mission readiness by coordinating with the company training NCO. Consistently pointed to as the model for 4 other platoons to follow.",
            "Designated as Operations OIC during missions, responsible for event monitoring and coordination between 7-10 physically isolated sections via line of sight, runners, and radio. Primary liaison between boots on the ground and higher echelons."
          ]
        },
        {
          "title": "Metadata Editor",
          "organisation": "University of Richmond, Boatwright Memorial Library",
          "from": "Sep 2008",
          "to": "Dec 2013",
          "details": [
            "Designed and created programs to automate digitizing and archiving projects spanning several thousand objects requiring minimal additional resources or ongoing maintenance.",
            "Primary point of contact to overcome technical obstacles and conduct preliminary research and customization for 3 departments in order to expand access to the library's digital collections."
          ]
        },
        {
          "title": "Student/Administrative Assistant",
          "organisation": "University of Richmond, Executive Education",
          "from": "Sep 2008",
          "to": "Dec 2013",
          "details": [
            "Responsible for classroom maintenance and materials preparation for 20-30 classes each month across 4 onsite classrooms and occasional offsite classrooms. Identified workflow improvements and provided technical support for instructors.",
            "Developed and maintained an inventory system to improve budget management."
          ]
        }
      ]
    }
  }
}