{
  "settings": {
    "icons": true
  },
  "firstname": "Michael",
  "familyname": "Weigle",
  "linkedin_id": "michaelweigle",
  "github_id": "metricmike",
  "bio_data": {
    "email": "michael.weigle@gmail.com",
    "phone": "+1 (615) 852-7737",
    "website": "http://metricmike.github.io",
    "skills": {
      "details": [
        {
          "type": "Programming Languages",
          "items": [
            "Ruby",
            "Java",
            "Javascript",
            "PHP"
          ]
        },
        {
          "type": "Web Frameworks and Libraries",
          "items": [
            "Rspec",
            "Rails",
            "Sass",
            "Leaflet",
            "Nokogiri"
          ]
        },
        {
          "type": "Databases",
          "items": [
            "MySQL",
            "PostgreSQL",
            "Lucene/Solr",
            "SQLite3"
          ]
        },
        {
          "type": "Certifications",
          "items": [
            "CompTIA A+",
            "CompTIA Network+",
            "CompTIA Security+"
          ]
        }
      ]
    },
    "education": {
      "schools": [
        {
          "degree": "Bachelor's",
          "major": "Computer Science",
          "institution": "University of Richmond",
          "graduation_year": 2013
        }
      ]
    },
    "experience": {
      "items": [
        {
          "title": "Company Executive Officer",
          "organisation": "US Army, 442nd Sig BN, HQ/A Co",
          "from": "May 2014",
          "to": "Dec 2014",
          "details": [
            "Provided supervision for and coordination between 35 Soldiers and 17 DA Civilians in conducting company operations (records management, battalion taskings, utilization for 15-60 students awaiting class) and filling annual training requirements.",
            "Assisted Company Commander with developing long-term goals and identifying areas of concern prior to issues developing. Assumed responsibility as acting Company Commander when necessary.",
            "Planned and organized monthly 'Zero Week' events for 30-35 students: a week-long onboarding designed for Captains attending training at Fort Gordon to complete educational attendance requirements (fitness tests, post in-processing, medical readiness), and highlight local resources, career opportunities, and Signal Corps goals."
          ]
        },
        {
          "title": "Platoon Leader, Operations OIC",
          "organisation": "US Army Reserves, 377th CBRN Co",
          "from": "Jan 2012",
          "to": "Dec 2013",
          "details": [
            "Led a group of 30-35 junior Soldiers to develop technical competence and both professional and personal goals.",
            "Ensured platoon's medical, training, and mission readiness according to guidelines set by the company training manager. Developed and maintained flexible communication plans that enabled platoon to easily stay in sync over 3 states despite civilian jobs, college, or other duties. Consistently pointed to as the model for 4 other company platoons to follow.",
            "Served as Operations OIC during missions, responsible for continuous event monitoring and coordination between 7-10 physically isolated sections via line of sight, runners, and radio. Primary liaison between technicians on the ground and the mission command team."
          ]
        },
        {
          "title": "Metadata Editor",
          "organisation": "University of Richmond, Boatwright Memorial Library",
          "from": "Sep 2008",
          "to": "Dec 2013",
          "details": [
            "Designed and created programs to automate digitizing and archiving projects spanning several thousand objects requiring minimal additional resources or ongoing maintenance.",
            "Key point of contact to overcome technical obstacles and conduct preliminary research and customization for 3 departments in order to expand access to the library's digital collections."
          ]
        },
        {
          "title": "Assistant Director of Operations",
          "organisation": "Dickman & Associates, LLC",
          "from": "May 2007",
          "to": "Aug 2009",
          "details": [
            "Helped lead a team of 5 real estate appraisers, working remotely, and 3 support staff to cover the entire Greater Washington Metropolitan Area.",
            "Maintained office inventory, payroll, accounts management for 15 banks and home construction companies, and appraiser state certification tracking and continuing education opportunities.",
            "Provided technical support, software license auditing, and remote troubleshooting enabling 48-hour turn-around times."
          ]
        }
      ]
    }
  }
}